{
    "poses": [
        "A person savoring a plate of mie goreng at a bustling warung, steam rising from the noodles under warm street lights.",
        "A devotee praying with hands pressed together in front of a golden Buddha statue at Borobudur temple during sunrise.",
        "A group of people dancing the traditional Kecak fire dance in a circle around a flickering flame.",
        "A commuter holding onto a handle inside a packed TransJakarta bus, looking out at the Jakarta skyline.",
        "A shopper negotiating prices with a vendor at the vibrant Malioboro Street market in Yogyakarta.",
        "A bride and groom in traditional Javanese wedding attire performing the sindur ceremony under an ornate pendopo.",
        "Children playing sepak takraw with intense concentration in a village courtyard, the ball frozen mid-air.",
        "A family lighting incense sticks and candles at a Chinese temple during Chinese New Year celebrations.",
        "A fisherman casting a net from a traditional outrigger boat (perahu) at dawn on calm waters.",
        "A group of people practicing Pencak Silat martial arts movements in a bamboo grove at sunrise.",
        "A street vendor ladling steaming gado-gado onto a plate at a colorful food cart.",
        "A rider navigating a motorbike through the chaotic streets of Jakarta, weaving between cars and buses.",
        "A student in a crisp white and grey uniform walking home along a tree-lined village path.",
        "A newspaper seller on a bicycle, tossing rolled papers to customers in the early morning mist.",
        "A batik artisan carefully applying hot wax to fabric with a canting tool in a traditional workshop.",
        "Elderly men playing chess under the shade of a large banyan tree in a village square.",
        "An office worker buying es cendol from a street vendor, with modern skyscrapers towering behind them.",
        "A person gracefully carrying a basket of tropical fruits on their head along a rural rice paddy path.",
        "A farmer with a conical hat (caping) working in flooded rice terraces under the morning sun.",
        "A group of people sitting cross-legged, sorting and drying coffee beans on large bamboo mats.",
        "A potter shaping clay on a wheel in an open-air workshop, surrounded by finished earthenware.",
        "Children joyfully swimming and splashing in a clear river surrounded by lush tropical vegetation.",
        "A person meticulously creating a colorful Penjor decoration from bamboo and palm leaves for Galungan.",
        "Dancers performing the graceful Legong dance with elaborate golden headdresses and silk costumes.",
        "Volunteers serving food to the community during a gotong royong (mutual assistance) gathering.",
        "A procession carrying ornate gamelan instruments through the streets during a temple festival.",
        "A child flying a colorful layang-layang kite from a hilltop, the string dancing in the tropical breeze.",
        "A classical Javanese dancer frozen in an elegant pose, wearing intricate traditional costume and makeup.",
        "A wayang kulit puppeteer manipulating shadow puppets behind a lit screen, telling an epic story.",
        "A gamelan musician playing the metallophone with concentrated precision during a performance.",
        "An elder teaching a young person how to weave a traditional bag from pandan leaves.",
        "A person expertly rolling and stuffing lumpia spring rolls in a busy kitchen filled with aromatic spices.",
        "A large extended family sharing a rijsttafel feast, sitting together on a woven mat.",
        "A parent teaching their child to ride a bicycle for the first time on a quiet kampung street.",
        "A group of monks in saffron robes walking in meditation at a Buddhist monastery in the mountains.",
        "A person floating a small banana leaf boat with flowers and candles on a river as an offering.",
        "A worshipper striking a bronze gong at the entrance of a Hindu temple, the sound resonating through the courtyard.",
        "Devotees carrying a large, decorated Ogoh-ogoh statue through the streets during Nyepi preparations."
    ]
}
