{
    "poses": [
        "A person laughing while eating a crispy pani puri from a street vendor's stall, city lights blurred in the background.",
        "A devotee with closed eyes, hands in a prayer mudra, offering a hibiscus garland to an idol in a dimly lit, ancient stone temple.",
        "A group of people, faces smeared with vibrant colored powder, dancing with joy under a spray of water during a festival.",
        "A commuter holding onto a pole inside a crowded local train, looking out the open door at the passing cityscape.",
        "A shopper skillfully bargaining with a vendor at a bustling and colorful weekly street market (haat).",
        "A couple exchanging flower garlands (varmala) on a decorated stage during a traditional wedding ceremony.",
        "A group of children with intense focus, playing a game of gully cricket on a narrow street with makeshift wickets.",
        "A family gathered on their porch, lighting a row of earthen oil lamps (diyas) during a serene evening festival.",
        "An ascetic sitting in a meditative pose on the ghats of the Ganges river at sunrise.",
        "A group of people practicing the sun salutation (Surya Namaskar) yoga pose in a lush green park in the early morning mist.",
        "A tea vendor pouring steaming hot masala chai from a height into a small glass at a rustic roadside stall.",
        "A driver confidently navigating a brightly decorated auto-rickshaw through a chaotic, traffic-filled city street.",
        "A student with a heavy backpack, walking home along a sun-dappled lane.",
        "A newspaper vendor on a bicycle, expertly flinging a rolled-up newspaper onto a balcony in the early morning.",
        "A tailor with a measuring tape around their neck, concentrating while using an old-fashioned sewing machine in a small shop.",
        "A group of elders sitting on a bench under a large banyan tree, engaged in a heated discussion over a game of cards.",
        "An office worker buying fresh coconut water from a street vendor, with a modern glass-and-steel building in the background.",
        "A person gracefully balancing a stack of clay pots on their head, walking along a dusty path in a rural village at sunset.",
        "An old farmer with a weathered face, ploughing a field with two bullocks under the hot morning sun.",
        "A group of people sitting in a circle, chatting and laughing while sorting through a fresh harvest of red chilies to be sun-dried.",
        "A potter shaping a mound of wet clay on a spinning wheel, their hands covered in mud, in a sunlit courtyard.",
        "Children gleefully splashing and playing with a buffalo in a village pond on a hot summer afternoon.",
        "A person creating an intricate and colorful rangoli or kolam design with fine powder on the doorstep of a home.",
        "Dancers performing with dandiya sticks, spinning in a large, energetic circle during Navratri celebrations.",
        "A volunteer serving food (langar) to people sitting in rows at a Gurudwara.",
        "A procession carrying a large, ornate Ganesha idol towards the sea for immersion, with people dancing and chanting.",
        "A young child flying a colorful kite from a rooftop during a festival, their eyes fixed on the sky.",
        "A classical dancer frozen in a dynamic, expressive pose on a stage, adorned with traditional makeup.",
        "A Kathakali performer with elaborate, traditional green-faced makeup, conveying a story through dramatic eye movements.",
        "A sitar player, eyes closed in concentration, fingers moving gracefully over the strings of the instrument.",
        "A puppeteer skillfully manipulating colorful string puppets (kathputli) to tell a folk tale.",
        "An elder sitting on a veranda, lovingly oiling and braiding a child's long hair.",
        "A person rolling out perfect, round chapatis on a wooden board (chakla) in a kitchen, with steam rising from a nearby pan.",
        "A large family sitting together on the floor of their living room, sharing a meal and animated conversation.",
        "A parent teaching a young child how to ride a bicycle for the first time in a quiet neighborhood lane.",
        "A Buddhist monastic walking silently in a line with others at a monastery in a mountainous region like Ladakh.",
        "A person floating a small boat made of leaves with a candle and flowers on a river as a prayer.",
        "A worshipper ringing a large brass bell upon entering a temple, its sound echoing through the hall.",
        "A crowd of devotees pulling a massive, intricately carved wooden temple chariot (rath) during a festival procession."
    ]
}